---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FabricationPartType
source: html/188814af-11af-6221-e3bb-380b61dde2b9.htm
---
# FabricationPartType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.